aabzel/ti_mcu_code_base/projects/cc26x2_ble_d/Application/cc26x2_ble.c
    if(pValChange != NULL)
    {
        pValChange->svcUUID = DATA_SERVICE_SERV_UUID;
        pValChange->paramID = paramID;
        memcpy(pValChange->data, pValue, len);
        pValChange->dataLen = len;

        if(ProjectZero_enqueueMsg(PZ_SERVICE_CFG_EVT, pValChange) != SUCCESS)
        {
          ICall_free(pValChange);
        }
    }
}

/*********************************************************************
 * @fn      ProjectZero_processOadWriteCB
 *
 * @brief   Process an OAD event
 *
 * @param   connHandle - the connection Handle this request is from.
 * @param   bim_var    - bim_var to set before resetting.
 *
 * @return  None.
 */
static void ProjectZero_processOadWriteCB(uint8_t event, uint16_t arg)
{
    Event_post(syncEvent, event);
}

/*
 *  Callbacks from Swi-context
 *****************************************************************************/

#ifdef DEFAULT_SEND_PARAM_UPDATE_REQ
/*********************************************************************
 * @fn      ProjectZero_paramUpdClockHandler
 *
 * @brief   Handler function for clock timeouts.
 *
 * @param   arg - app message pointer
 */
static void ProjectZero_paramUpdClockHandler(UArg arg)
{
    pzSendParamReq_t *req =
        (pzSendParamReq_t *)ICall_malloc(sizeof(pzSendParamReq_t));
    if(req)
    {
        req->connHandle = (uint16_t)arg;
        if(ProjectZero_enqueueMsg(PZ_SEND_PARAM_UPD_EVT, req) != SUCCESS)
        {
          ICall_free(req);
        }
    }
}
#endif

/*
 *  Utility functions
*/

/*********************************************************************
 * @fn     ProjectZero_enqueueMsg
 *
 * @brief  Utility function that sends the event and data to the application.
 *         Handled in the task loop.
 *
 * @param  event    Event type
 * @param  pData    Pointer to message data
 */
static status_t ProjectZero_enqueueMsg(uint8_t event, void *pData)
{
    uint8_t success;
    pzMsg_t *pMsg = ICall_malloc(sizeof(pzMsg_t));

    if(pMsg)
    {
        pMsg->event = event;
        pMsg->pData = pData;

        success = Util_enqueueMsg(appMsgQueueHandle, syncEvent, (uint8_t *)pMsg);
        return (success) ? SUCCESS : FAILURE;
    }

    return(bleMemAllocError);
}

/*********************************************************************
 * @fn     util_arrtohex
 *
 * @brief   Convert {0x01, 0x02} to "01:02"
 *
 * @param   src - source byte-array
 * @param   src_len - length of array
 * @param   dst - destination string-array
 * @param   dst_len - length of array
 *
 * @return  array as string
 */
char * util_arrtohex(uint8_t const *src, uint8_t src_len,
                     uint8_t *dst, uint8_t dst_len, uint8_t reverse)
{
    char hex[] = "0123456789ABCDEF";
    uint8_t *pStr = dst;
    uint8_t avail = dst_len - 1;
    int8_t inc = 1;
    if(reverse)
    {
        src = src + src_len - 1;
        inc = -1;
    }

    memset(dst, 0, avail);

    while(src_len && avail > 3)
    {
        if(avail < dst_len - 1)
        {
            *pStr++ = ':';
            avail -= 1;
        }

        *pStr++ = hex[*src >> 4];
        *pStr++ = hex[*src & 0x0F];
        src += inc;
        avail -= 2;
        src_len--;
    }

    if(src_len && avail)
    {
        *pStr++ = ':'; // Indicate not all data fit on line.
    }
    return((char *)dst);
}

/*********************************************************************
 * @fn     util_getLocalNameStr
 *
 * @brief   Extract the LOCALNAME from Scan/AdvData
 *
 * @param   data - Pointer to the advertisement or scan response data
 * @param   len  - Length of advertisment or scan repsonse data
 *
 * @return  Pointer to null-terminated string with the adv local name.
 */
static char * util_getLocalNameStr(const uint8_t *data, uint8_t len)
{
    uint8_t nuggetLen = 0;
    uint8_t nuggetType = 0;
    uint8_t advIdx = 0;

    static char localNameStr[32] = { 0 };
    memset(localNameStr, 0, sizeof(localNameStr));

    for(advIdx = 0; advIdx < len; )
    {
        nuggetLen = data[advIdx++];
        nuggetType = data[advIdx];
        if((nuggetType == GAP_ADTYPE_LOCAL_NAME_COMPLETE ||
            nuggetType == GAP_ADTYPE_LOCAL_NAME_SHORT) )
        {
            uint8_t len_temp = nuggetLen < (sizeof(localNameStr)-1)? (nuggetLen - 1):(sizeof(localNameStr)-2);
            // Only copy the first 31 characters, if name bigger than 31.
            memcpy(localNameStr, &data[advIdx + 1], len_temp);
            break;
        }
        else
        {
            advIdx += nuggetLen;
        }
    }

    return(localNameStr);
}

/*********************************************************************
 * @fn      projectZero_eraseExternalFlash
 *
 * @brief   Utility function that erases external flash content
 *
 * @return  void
 */
void projectZero_eraseExternalFlash(void)
{
    NVS_Handle nvsHandle;
    NVS_Attrs regionAttrs;
    NVS_Params nvsParams;

    NVS_init();
    NVS_Params_init(&nvsParams);

    Log_info0("Opening external flash for mass erase");
    nvsHandle = NVS_open(CONFIG_NVSEXTERNAL, &nvsParams);
    if (nvsHandle == NULL)
    {
        Log_error0("Failed to open external flash");
        return;
    }
    NVS_getAttrs(nvsHandle, &regionAttrs);
    Log_info3("ExtFlash regionBase: 0x%x, regionSize: 0x%x, sectorSize: 0x%x",
              (uintptr_t)regionAttrs.regionBase,
              (uintptr_t)regionAttrs.regionSize,
              (uintptr_t)regionAttrs.sectorSize);

    // Do sector by sector erase
    for (uint32_t offset = 0; offset < regionAttrs.regionSize; offset += regionAttrs.sectorSize)
    {
        uint16_t status = NVS_erase(nvsHandle, offset, regionAttrs.sectorSize);

        // Sleep every 16th erase to print log and serve other things like network
        uint32_t curSector = (offset / regionAttrs.sectorSize);
        if ((curSector & 0xf) == 0xf)
        {
            Log_info3("Erase sector %d..%d, status: %d", curSector-0xf, curSector, status);
            Task_sleep(20 * (1000/Clock_tickPeriod));
        }
    }

    // Block until ready with meaningless read.
    uint32_t buf;
    NVS_read(nvsHandle, 0, &buf, sizeof(buf));

    Log_info0("External flash erase complete");
    NVS_close(nvsHandle);
}

#if 0
/*********************************************************************
 * @fn      projectZero_revertToFactoryImage
 *
 * @brief   Utility function that invalidates this image and reboots,
 *          in order for BIM to load the image in the factory slot.
 *
 * @return  void
 */
static void projectZero_revertToFactoryImage(void)
{
    extern const imgHdr_t _imgHdr;

    uint32_t key = HwiP_disable();

    uint8_t invalidCrc = CRC_INVALID;
    uint32_t retVal = FlashProgram(&invalidCrc,
                                   (uint32_t)&_imgHdr.fixedHdr.crcStat,
                                   sizeof(invalidCrc));
    if (retVal == FAPI_STATUS_SUCCESS)    {
        Log_info0("CRC Status invalidated. Rebooting into BIM.");
        Task_sleep(50 * (1000 / Clock_tickPeriod));
        SysCtrlSystemReset();
        // We never reach here.
    }    else    {
        Log_error1("CRC Invalidate write failed. Status 0x%x", retVal);
        Log_error0("Continuing boot");
    }

    HwiP_restore(key);
}
#endif
